
{{alias}}( x )
    Evaluates the identity function for an unsigned 16-bit integer `x`.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Input value.

    Examples
    --------
    > var y = {{alias}}( 1 )
    1
    > y = {{alias}}( 2 )
    2
    > y = {{alias}}( 0 )
    0
    > y = {{alias}}( 65535 )
    65535

    See Also
    --------

